{
  "header": {
    "links": ["Anasayfa", "Çoklu Dil", "Pop-uplar", "Github"]
  },
  "homepage": {
    "heading": "Hızlı proje geliştirme yolu",
    "description": "Next.JS TypeScript çok amaçlı şablonu ile web uygulamaları oluşturmak kolaylaşıyor. Next.JS, TypeScript, dağıtım yardımcıları, linterlar, SEO yardımcıları, çoklu dil desteği ve paketsiz pop-up düzenleri ile web uygulamaları oluşturmak artık çok kolay. Projelerin benzersiz ihtiyaçlarına uyacak şekilde genişletilebilir ve özelleştirilebilir.",
    "features": {
      "heading": "Özellikler",
      "elements": [
        {
          "heading": "TypeScript",
          "description": "TypeScript ile oluşturuldu. TypeScript, düz JavaScript'e derlenebilen, tip dışavurumu içeren bir JavaScript üst kümesidir."
        },
        {
          "heading": "Deployment Yardımcıları",
          "description": "Projenizin dağıtımını kolaylaştırmak için Base URL, Otomatik site haritası vb. gibi dağıtım yardımcılarını içerir."
        },
        {
          "heading": "Linter",
          "description": "Kodunuzu daha okunaklı ve tutarlı hale getirmek için TypeScript için yapılandırılmış ESLint ve Prettier dahil edilmiştir."
        },
        {
          "heading": "SEO Yardımcıları",
          "description": "Projenizi arama motoru dostu hale getirmek için Meta Etiketleri, Open Graph, OG etiketleri vb. gibi SEO yardımcılarını içerir."
        },
        {
          "heading": "Çoklu Dil",
          "description": "Projenizi çoklu dil desteği ile kullanıma hazır hale getirmek için çoklu dil düzeni ve i18n desteği dahil edilmiştir."
        },
        {
          "heading": "Pop-uplar",
          "description": "Paket gerektirmeksizin projenize saf pop-up'lar eklemek için pop-up düzeni dahil edilmiştir."
        }
      ]
    },
    "last-text": "ve daha fazlası."
  },
  "popups": {
    "heading": "Pop-uplar",
    "description": "Context temelli yaklaşım, popup bileşenlerinin sorunsuz bir şekilde entegre edilmesine olanak tanır ve projenize entegre etmeyi kolaylaştırır. Genişletilebilirlik göz önünde bulundurularak, düzen ek pop-up'ları barındırarak uygulamanızı bir sonraki seviyeye taşıyabilir.",
    "examples": {
      "heading": "Örnekler",
      "last-text": "ve daha fazlası, tamamen size kalmış."
    }
  },
  "multilingual": {
    "heading": "Çoklu Dil",
    "description": "Projenizi çoklu dil desteği ile kullanıma hazır hale getirmek için çoklu dil düzeni ve i18n desteği dahil edilmiştir.",
    "example": {
      "heading": "Örnek"
    }
  }
}
